app/controllers/admin_controller.rb

  def add_user
    @person = Person.new
    @person.roles << Role.find(:all,:conditions=>"name='admin'")
---
SELECT "roles".* FROM "roles" WHERE (name='admin')