app/controllers/availability_descriptions_controller.rb

  def index
    @availability_descriptions = AvailabilityDescription.all
---
SELECT "availability_descriptions".* FROM "availability_descriptions"

  def show
    @availability_description = AvailabilityDescription.find(params[:id])
---
SELECT "availability_descriptions".* FROM "availability_descriptions" WHERE "availability_descriptions"."id" = 980190962 LIMIT 1

  def edit
    @availability_description = AvailabilityDescription.find(params[:id])
---
SELECT "availability_descriptions".* FROM "availability_descriptions" WHERE "availability_descriptions"."id" = 980190962 LIMIT 1

  def update
    @availability_description = AvailabilityDescription.find(params[:id])
---
SELECT "availability_descriptions".* FROM "availability_descriptions" WHERE "availability_descriptions"."id" = 980190962 LIMIT 1

  def destroy
    @availability_description = AvailabilityDescription.find(params[:id])
    @availability_description.destroy
---
SELECT "availability_descriptions".* FROM "availability_descriptions" WHERE "availability_descriptions"."id" = 980190962 LIMIT 1
DELETE FROM "availability_descriptions" WHERE "availability_descriptions"."id" = 980190962