app/controllers/contents_controller.rb

SELECT "contents".* FROM "contents"
---
  def index
    @contents = Content.all

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 980190962 LIMIT 1
---
  def show
    @content = Content.find(params[:id])

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 980190962 LIMIT 1
---
  def edit
#    @content = Content.find(params[:id])

#    @picture = Content.new
#    @etd = Etd.find(params[:id])
    @etd = Etd.find(params[:etd_id])
    @contents = @etd.contents.find(:all)

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 980190962 LIMIT 1
---
  def update
  # fetch objects to be use in the view
    @etd = Etd.find(params[:etd_id])
    @content = Content.new(params[:content])


    # check if there is any change or update of picture/etd itself
    if @content.save
        #puts "this is picture.save\n"
        @etd.contents<< @content
    else
        #puts "this is not picture.save\n"
    end

   #  @picture = Content.new(params[:etd][:contents][:uploaded_picture])
   #      @picture.save
   #      @etd.contents<< @picture
   #  @etd.save

  # add 5 contents build?? Check up this line code
  # 5.times { @etd.contents.build }


    # for mixed case of etds
    if @etd.update_attributes(params[:etd])
      # in case of changing etd avaiability
      unless @etd.availability.name.eql? "Mixed"
         @etd.contents.each do |content|

SELECT "contents".* FROM "contents" WHERE "contents"."id" = 980190962 LIMIT 1
---
  def destroy
    @content = Content.find(params[:id])