app/controllers/copyright_statements_controller.rb

SELECT "copyright_statements".* FROM "copyright_statements"
---
  def index
    @copyright_statements = CopyrightStatement.all

SELECT "copyright_statements".* FROM "copyright_statements" WHERE "copyright_statements"."id" = 980190962 LIMIT 1
---
  def show
    @copyright_statement = CopyrightStatement.find(params[:id])

SELECT "copyright_statements".* FROM "copyright_statements" WHERE "copyright_statements"."id" = 980190962 LIMIT 1
---
  def edit
    @copyright_statement = CopyrightStatement.find(params[:id])

SELECT "copyright_statements".* FROM "copyright_statements" WHERE "copyright_statements"."id" = 980190962 LIMIT 1
---
  def update
    @copyright_statement = CopyrightStatement.find(params[:id])

SELECT "copyright_statements".* FROM "copyright_statements" WHERE "copyright_statements"."id" = 980190962 LIMIT 1
DELETE FROM "copyright_statements" WHERE "copyright_statements"."id" = 980190962
---
  def destroy
    @copyright_statement = CopyrightStatement.find(params[:id])
    Provenance.create(person: current_person, action: "destroyed", model: @copyright_statement)
    @copyright_statement.destroy