app/controllers/degree_descriptions_controller.rb

  def index
    @degree_descriptions = DegreeDescription.all
---
SELECT "degree_descriptions".* FROM "degree_descriptions"

  def show
    @degree_description = DegreeDescription.find(params[:id])
---
SELECT "degree_descriptions".* FROM "degree_descriptions" WHERE "degree_descriptions"."id" = 980190962 LIMIT 1

  def edit
    @degree_description = DegreeDescription.find(params[:id])
---
SELECT "degree_descriptions".* FROM "degree_descriptions" WHERE "degree_descriptions"."id" = 980190962 LIMIT 1

  def update
    @degree_description = DegreeDescription.find(params[:id])
---
SELECT "degree_descriptions".* FROM "degree_descriptions" WHERE "degree_descriptions"."id" = 980190962 LIMIT 1

  def destroy
    @degree_description = DegreeDescription.find(params[:id])
    @degree_description.destroy
---
SELECT "degree_descriptions".* FROM "degree_descriptions" WHERE "degree_descriptions"."id" = 980190962 LIMIT 1
DELETE FROM "degree_descriptions" WHERE "degree_descriptions"."id" = 980190962