app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 980190962 LIMIT 1
---
  def show
    @department = Department.find(params[:id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 980190962 LIMIT 1
---
  def edit
    @department = Department.find(params[:id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 980190962 LIMIT 1
---
  def update
    @department = Department.find(params[:id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 980190962 LIMIT 1
DELETE FROM "departments" WHERE "departments"."id" = 980190962
---
  def destroy
    @department = Department.find(params[:id])
    Provenance.create(person: current_person, action: "destroyed", model: @department)
    @department.destroy