app/controllers/digital_objects_controller.rb

  def index
    @digital_objects = DigitalObject.all
---
SELECT "digital_objects".* FROM "digital_objects"

  def show
    @digital_object = DigitalObject.find(params[:id])
---
SELECT "digital_objects".* FROM "digital_objects" WHERE "digital_objects"."id" = 980190962 LIMIT 1

  def edit
    @digital_object = DigitalObject.find(params[:id])
---
SELECT "digital_objects".* FROM "digital_objects" WHERE "digital_objects"."id" = 980190962 LIMIT 1

  def update
    @digital_object = DigitalObject.find(params[:id])
---
SELECT "digital_objects".* FROM "digital_objects" WHERE "digital_objects"."id" = 980190962 LIMIT 1

  def destroy
    @digital_object = DigitalObject.find(params[:id])
    @digital_object.destroy
---
SELECT "digital_objects".* FROM "digital_objects" WHERE "digital_objects"."id" = 980190962 LIMIT 1
DELETE FROM "digital_objects" WHERE "digital_objects"."id" = 980190962