app/controllers/doc_type_descriptions_controller.rb

SELECT "doc_type_descriptions".* FROM "doc_type_descriptions"
---
  def index
    @doc_type_descriptions = DocTypeDescription.all

SELECT "doc_type_descriptions".* FROM "doc_type_descriptions" WHERE "doc_type_descriptions"."id" = 980190962 LIMIT 1
---
  def show
    @doc_type_description = DocTypeDescription.find(params[:id])

SELECT "doc_type_descriptions".* FROM "doc_type_descriptions" WHERE "doc_type_descriptions"."id" = 980190962 LIMIT 1
---
  def edit
    @doc_type_description = DocTypeDescription.find(params[:id])

SELECT "doc_type_descriptions".* FROM "doc_type_descriptions" WHERE "doc_type_descriptions"."id" = 980190962 LIMIT 1
---
  def update
    @doc_type_description = DocTypeDescription.find(params[:id])

SELECT "doc_type_descriptions".* FROM "doc_type_descriptions" WHERE "doc_type_descriptions"."id" = 980190962 LIMIT 1
DELETE FROM "doc_type_descriptions" WHERE "doc_type_descriptions"."id" = 980190962
---
  def destroy
    @doc_type_description = DocTypeDescription.find(params[:id])
    @doc_type_description.destroy