app/controllers/etds_controller.rb

  def index
    # This is a bit of black magic.
    @etds = []
    case params[:order]
    when "department"
      # Previous query
      # @etds = Etd.find(:all, include: :departments, order: 'departments.name')
      # Updated query for pagination
      @etds = Etd.paginate(:page => params[:page], include: :departments, order: 'departments.name', :per_page => 10)
---
SELECT "etds".* FROM "etds"

  def show
    @etd = Etd.find(params[:id])
---
SELECT "etds".* FROM "etds" WHERE "etds"."id" = 1 LIMIT 1

  def edit
    respond_to do |format|
      @etd = Etd.find(params[:id])
---
SELECT "etds".* FROM "etds" WHERE "etds"."id" = 23 LIMIT 1

  def create
    @etd = Etd.new(params[:etd])

    #Add implied params.
    @etd.cdate = Time.now()
    @etd.status = "Created"
    @etd.urn = Time.now().strftime("etd-%Y%m%d-%H%M%S%2L")
    @etd.url = "http://scholar.lib.vt.edu/theses/submitted/#{@etd.urn}/"

    # Don't add a blank second department.
    d = [params[:etd][:department_ids][:id_1]]
    if params[:etd][:department_ids][:id_2] != "" then
      d << params[:etd][:department_ids][:id_2]
---
INSERT INTO "etds" ("urn", "degree", "department", "dtype", "title", "abstract", "availability", "ddate", "sdate", "adate", "cdate", "rdate", "pid", "url", "timestamp", "bound", "created_at", "updated_at", "committee_chair_id", "author_id") VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-09-05 23:25:52.974632', '2011-09-05 23:25:52.974632', NULL, NULL)

  def update
    @etd = Etd.find(params[:id])

    # Don't add a blank second department.
    d = [params[:etd][:department_ids][:id_1]]
    if params[:etd][:department_ids][:id_2] != "" then
      d << params[:etd][:department_ids][:id_2]
    end
    params[:etd][:department_ids] = d

    respond_to do |format|
      if @etd.update_attributes(params[:etd])
---
SELECT "etds".* FROM "etds" WHERE "etds"."id" = 25 LIMIT 1
UPDATE "etds" SET "availability" = 'lolololol', "updated_at" = '2011-08-11 20:23:52.303662' WHERE "etds"."id" = 25