app/controllers/people_controller.rb

  def destroy
    @person = Person.find(params[:id])

    # Destroy ETDs this person has Authored.
    author = Role.where(:name => "Author").first()
    for pr in @person.people_roles do
      if pr.role_id == author.id
        etd = Etd.find(pr.etd_id)
        etd.destroy
      end
    end

    @person.destroy
---
SELECT * FROM "etds" INNER JOIN "etds_people" ON "etds".id = "etds_people".etd_id WHERE ("etds_people".person_id = 980190962 )
SELECT * FROM "roles" INNER JOIN "people_roles" ON "roles".id = "people_roles".role_id WHERE ("people_roles".person_id = 980190962 )
DELETE FROM "people" WHERE "people"."id" = 980190962
DELETE FROM "people_roles" WHERE "people_roles"."person_id" = 27 AND "people_roles"."role_id" IN (5)