app/controllers/permissions_controller.rb

  def index
    @permissions = Permission.all
---
SELECT "permissions".* FROM "permissions"

  def show
    @permission = Permission.find(params[:id])
---
SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = 980190962 LIMIT 1

  def edit
    @permission = Permission.find(params[:id])
---
SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = 980190962 LIMIT 1

    end

    respond_to do |format|
      if @permission.save
---
INSERT INTO "permissions" ("created_at", "updated_at", "action_id", "role_id", "digital_object_id") VALUES ('2011-09-05 23:25:53.323200', '2011-09-05 23:25:53.323200', NULL, NULL, NULL)

  def update
    @permission = Permission.find(params[:id])
---
SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = 980190962 LIMIT 1

  def destroy
    @permission = Permission.find(params[:id])
    @permission.destroy
---
SELECT "permissions".* FROM "permissions" WHERE "permissions"."id" = 980190962 LIMIT 1
DELETE FROM "permissions" WHERE "permissions"."id" = 980190962