app/controllers/provenances_controller.rb

SELECT "provenances".* FROM "provenances"
---
  def index
    @per_page = Pagination_Helper.sanitize_per_page(params[:per_page])

    @person_is_admin = current_person.in_role_group?('Administration')
    @provenances = nil
    if @person_is_admin
      @provenances = Provenance.where('id not null')
    else
      @provenances = Provenance.where(person_id: current_person.id)
    end
    if params[:type].nil?
      @provenances = @provenances.paginate(:page => params[:page], per_page: @per_page, order: ['id DESC'])

SELECT "provenances".* FROM "provenances" WHERE "provenances"."id" = 980190962 LIMIT 1
---
  def show
    @provenance = Provenance.find(params[:id])

SELECT "provenances".* FROM "provenances" WHERE "provenances"."id" = 980190962 LIMIT 1
---
  def edit
    @provenance = Provenance.find(params[:id])

SELECT "provenances".* FROM "provenances" WHERE "provenances"."id" = 980190962 LIMIT 1
---
  def update
    @provenance = Provenance.find(params[:id])

SELECT "provenances".* FROM "provenances" WHERE "provenances"."id" = 980190962 LIMIT 1
DELETE FROM "provenances" WHERE "provenances"."id" = 980190962
---
  def destroy
    @provenance = Provenance.find(params[:id])
    @provenance.destroy