app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 980190962 LIMIT 1
---
  def show
    @role = Role.find(params[:id])

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 980190962 LIMIT 1
---
  def edit
    @role = Role.find(params[:id])

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ('admin', '2011-04-28 21:09:30.285735', '2011-04-28 21:09:30.285735')
---
  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 980190962 LIMIT 1
---
  def update
    @role = Role.find(params[:id])

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 980190962 LIMIT 1
DELETE FROM "roles" WHERE "roles"."id" = 980190962
---
  def destroy
    @role = Role.find(params[:id])
    @role.destroy