app/controllers/sessions_controller.rb

SELECT "roles".* FROM "roles" WHERE (name='author') LIMIT 1
---
  def create
    #
    # Authentication
    # user is a type of Person
    @person = Person.authenticate(params[:session2][:name],
                             params[:session2][:password])
    respond_to do |format|

      if @person.nil?
      # Create an error message and re-render the signin form.
        #format.html {redirect_to(:controller => 'submit', :action => 'login', :notice => 'Invalid authentication')}
        format.html {redirect_to(:controller => 'sessions', :action => 'loginfailure', :notice => 'Invalid authentication')}
      else
      # Sign the user in and redirect to the user's show page.
        session[:user_id] = @person.pid

      # Authorization
      # Before letting a user landing on the user page, we need to check authorization
        if @person.authorize.nil?
          @person.roles << Role.find(:first,:conditions=>"name='author'")