app/controllers/submit_controller.rb

SELECT "etds".* FROM "etds"
---
  def index_etd
    @etds = Etd.all

SELECT "roles"."id" FROM "roles" INNER JOIN "people_roles" ON "roles".id = "people_roles".role_id WHERE "roles"."id" = 5 AND ("people_roles".person_id = NULL ) LIMIT 1
---
  def new_etd
    @etd = Etd.new
    #begin
      @author = Person.find(:first, :conditions => "pid='#{session[:user_id]}'")
      if @author
	      if !@author.roles.find(:first,:conditions=>"name='Author'")

SELECT "roles"."id" FROM "roles" INNER JOIN "people_roles" ON "roles".id = "people_roles".role_id WHERE "roles"."id" = 5 AND ("people_roles".person_id = NULL ) LIMIT 1
INSERT INTO "etds" ("urn", "degree", "department", "dtype", "title", "abstract", "availability", "ddate", "sdate", "adate", "cdate", "rdate", "pid", "url", "timestamp", "bound", "created_at", "updated_at", "committee_chair_id", "author_id") VALUES ('etd-4292011-14528', 'PhD', 'Computer Science', 'Thesis', 'one', 'two', 'restricted', '2011-04-29', '2011-04-29', '2011-04-29', '2011-04-29', '2011-04-29', 'rotated8', 'www.google.com', '2011-04-29 18:04:00.000000', 'no', '2011-04-29 18:05:28.556152', '2011-04-29 18:05:28.556152', NULL, NULL)
INSERT INTO "etds_people" ("etd_id", "person_id") VALUES (26, 26)
INSERT INTO "people" ("role", "first_name", "middle_name", "last_name", "email", "pid", "suffix", "created_at", "updated_at", "roles_mask") VALUES ('author', NULL, NULL, NULL, NULL, 'rotated8', NULL, '2011-04-29 18:05:28.504640', '2011-04-29 18:05:28.504640', NULL)
---
  def create_etd
    @etd = Etd.new(params[:etd])
    #@etd.urn = "etd-#{Time.now.month}#{Time.now.day}#{Time.now.year}-#{Time.now.hour}#{Time.now.min}#{Time.now.sec}"


    #@author = Person.find(params[:etdl_person_ids])
    #begin
      @author = Person.find(:first, :conditions => "pid='#{session[:user_id]}'")
      if @author
	      if !@author.roles.find(:first,:conditions=>"name='Author'")
	      	@author=nil;
	      end
      end
      #rescue

     # create a new author less there no author exist
      @author ||= Person.new
      @author.pid = session[:user_id]
      # the first author will save the role 'author' into the Role table
      @author.roles << Role.find(:first,:conditions=> "name='Author'") unless @author.roles.include? Role.find(:first,:conditions=> "name='Author'")
      #@author.role = 'author'
      @author.save
    #end
      @role = Role.find(:first, :conditions=>"name='Author'")
      #etd has many people and roles.
      @etd.people<<@author

SELECT * FROM "roles" INNER JOIN "people_roles" ON "roles".id = "people_roles".role_id WHERE ("people_roles".person_id = 26 )
SELECT * FROM "etds" INNER JOIN "etds_people" ON "etds".id = "etds_people".etd_id WHERE ("etds_people".person_id = 26 )
---
  def show_etds_by_author
    @session_id = session[:user_id]
    #begin
      #@author = Person.find(:first, :conditions => "pid='#{@session_id}' and role='author'")
      @author = Person.find(:first, :conditions => "pid='#{@session_id}'")
      if @author
	      if @author.roles.find(:first,:conditions=> "name='Author'").nil?

	      end
      end

    #rescue
      @author ||= Person.new
      @author.pid = session[:user_id]
    #end
    @etdss = []

    respond_to do |format|
      if @author.nil?
        #format.html { redirect_to(:controller=>"sessions", :action=>"new",:author_pid=>@author.pid) }
        #format.html { redirect_to(:controller=>"submit", :action => "new_etd") }
        format.html {redirect_to( :controller => :people, :action => :new)}
      else
        @ability = Ability.new(@author)
        @etdss = @author.etds unless @author.etds.empty? unless @author.nil?

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 18 LIMIT 1
SELECT * FROM "people" INNER JOIN "etds_people" ON "people".id = "etds_people".person_id WHERE ("etds_people".etd_id = 26 ) AND (role='author') LIMIT 1
UPDATE "etds" SET "availability" = '{:value=>"withheld"}', "updated_at" = '2011-04-29 18:43:27.395388' WHERE "etds"."id" = 26
SELECT "contents".* FROM "contents" WHERE ("contents".etd_id = 26)
---
  def show_etd
    @etd = Etd.find(params[:id])
    @author = @etd.people.find(:first, :conditions => "role='author'") unless @etd.people.empty?

    respond_to do |format|
    # Update Etd attributes
      if @etd.update_attributes(params[:etd])
        unless @etd.availability.eql? "mixed"
          @etd.contents.each do |content|

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 26 LIMIT 1
SELECT * FROM "people" INNER JOIN "etds_people" ON "people".id = "etds_people".person_id WHERE ("etds_people".etd_id = 26 ) AND (role='author') LIMIT 1
---
  def edit_etd
    @etd = Etd.find(params[:id])
    @author = @etd.people.find(:first, :conditions => "role='author'") unless @etd.people.empty?

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 26 LIMIT 1
SELECT * FROM "people" INNER JOIN "etds_people" ON "people".id = "etds_people".person_id WHERE ("etds_people".etd_id = 26 ) AND (role='author') LIMIT 1
---
  def view_committee
    @etd = Etd.find(params[:id])
    @author = @etd.people.find(:first, :conditions => "role='author'") unless @etd.people.empty?

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 24 LIMIT 1
---
  def add_committee
    @etd = Etd.find(params[:id])

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 24 LIMIT 1
---
  def add_files
    @picture = Content.new
    @etd = Etd.find(params[:id])

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 26 LIMIT 1
SELECT * FROM "people" INNER JOIN "etds_people" ON "people".id = "etds_people".person_id WHERE ("etds_people".etd_id = 26 ) AND (role='author') LIMIT 1
SELECT "contents".id FROM "contents" WHERE ("contents".etd_id = 26)
---
  def show_files

    @etd = Etd.find(params[:id])
    @author = @etd.people.find(:first, :conditions => "role='author'") unless @etd.people.empty?
    @contents = nil
    @contents = Content.find(@etd.content_ids) unless @etd.contents.nil?

SELECT "etds".* FROM "etds" WHERE "etds"."id" = 24 LIMIT 1
---
  def change_availability
    @etd= Etd.find(params[:id])